---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutFailure
source: html/cd6e1025-f99f-c17c-bd71-25e4194d50bd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutFailure Property

Fail to generate the automatic landing layout

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsAutomaticLandingLayoutFailure { get; }
```